CSI API ETABS v1

# cFrameObjCount Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int Count(
    	string MyType = "All"
    )

    Function Count (
    	Optional MyType As String = "All"
    ) As Integer

    Dim instance As cFrameObj
    Dim MyType As String
    Dim returnValue As Integer

    returnValue = instance.Count(MyType)

    int Count(
    	String^ MyType = L"All"
    )

    abstract Count :
            ?MyType : string
    (* Defaults:
            let _MyType = defaultArg MyType "All"
    *)
    -> int

#### Parameters

MyType (Optional)

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com